docs/comp-sci/fortran/fweb.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FWEB - Fortran</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">FWEB - Fortran</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-14b2d0de-79be-4c2b-bc55-6e94bf3ac551">1. Overview</a></li>
<li><a href="#h-34dbdfe6-cbb2-414d-a06d-f5f47732fa19">2. Markup</a>
<ul>
<li><a href="#h-bb4663b9-becf-4f6f-86ee-9c445efd9579">2.1. Code Chunks</a></li>
<li><a href="#h-667c3094-b49f-41e3-a35a-67a84c49f33d">2.2. Writing to multiple files</a></li>
</ul>
</li>
<li><a href="#h-b7a65be1-125b-4583-9813-87a55fdb937e">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-14b2d0de-79be-4c2b-bc55-6e94bf3ac551" class="outline-2">
<h2 id="h-14b2d0de-79be-4c2b-bc55-6e94bf3ac551"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-14b2d0de-79be-4c2b-bc55-6e94bf3ac551">
<p>
FWEB is a literate programming tool for Fortran (and Ratfor and
C/C++). It resembles WEB/cweb in its use of "chunks" (sections). Unlike
WEB/cweb, it produces LaTeX (instead of plain TeX). One
must begin with the specification of the programming language used, and
we may change the language freely as we program. For example, we could
start with Fortran 90 using <code>&amp;</code> for line continuations by writing:
</p>

<pre class="example" id="org5956742">
@n9[-n&amp;]
</pre>

<p>
Three things happen in this:
</p>
<ul class="org-ul">
<li>The <code>n9</code> specifies it is Fortran-90,</li>
<li>the <code>[...]</code> indicates additional configuration options,</li>
<li>the <code>-n&amp;</code> specifies Fortran will use the <code>&amp;</code> for line continuations.</li>
</ul>
</div>
</div>

<div id="outline-container-h-34dbdfe6-cbb2-414d-a06d-f5f47732fa19" class="outline-2">
<h2 id="h-34dbdfe6-cbb2-414d-a06d-f5f47732fa19"><span class="section-number-2">2.</span> Markup</h2>
<div class="outline-text-2" id="text-h-34dbdfe6-cbb2-414d-a06d-f5f47732fa19">
<p>
Sections are indicates by writing <code>@*</code> (a synonym for <code>@*0</code>),
subsections are started by writing <code>@*1</code>, subsubsections are started
with <code>@*2</code>, and so on. These are weaved into LaTeX <code>\section</code>,
<code>\subsection</code>, <code>\subsubsection</code>, etc., counterparts.
</p>

<p>
Un-named sections are started by writing <code>@</code> followed by a space, but in
practice they typically have their own line.
</p>

<pre class="example" id="org6f1dba1">
@ INTRODUCTION.
This is an example of a named section.

@
This is an un-numbered section.
</pre>
</div>

<div id="outline-container-h-bb4663b9-becf-4f6f-86ee-9c445efd9579" class="outline-3">
<h3 id="h-bb4663b9-becf-4f6f-86ee-9c445efd9579"><span class="section-number-3">2.1.</span> Code Chunks</h3>
<div class="outline-text-3" id="text-h-bb4663b9-becf-4f6f-86ee-9c445efd9579">
<p>
Code may be started in an un-named section by writing <code>@a</code>, while named
code chunks are started by something like <code>@&lt;Global variables@&gt;=...</code>
(just replace the "&#x2026;" with your code).
</p>
</div>
</div>

<div id="outline-container-h-667c3094-b49f-41e3-a35a-67a84c49f33d" class="outline-3">
<h3 id="h-667c3094-b49f-41e3-a35a-67a84c49f33d"><span class="section-number-3">2.2.</span> Writing to multiple files</h3>
<div class="outline-text-3" id="text-h-667c3094-b49f-41e3-a35a-67a84c49f33d">
<p>
If we want to split up code among several files, we can do so with the
<a href="https://w3.pppl.gov/~krommes/fweb.html#SEC157"><code>@O</code> macro</a> (there is also the <code>@o</code> macro for "locally open a file"). For
example:
</p>

<pre class="example" id="org9ff59a1">
@c
@* INTRO.
We assume command-line redirection into \.{test.h} (`\.{-=test.h}').

@d A 1 // This will go into \.{test.h}.

@a
@&lt;Header material@&gt;@; // Also goes into \.{test.h}.
@O test.c // Remaining unnamed sections go into \.{test.c}.

@ Header material may be defined as needed throughout the code, but
with this design it will all go into \.{test.h}.

@&lt;Header material@&gt;=

@&lt;Includes@&gt;@;
@&lt;Typedefs@&gt;@;
@&lt;Global variables@&gt;@;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-b7a65be1-125b-4583-9813-87a55fdb937e" class="outline-2">
<h2 id="h-b7a65be1-125b-4583-9813-87a55fdb937e"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-b7a65be1-125b-4583-9813-87a55fdb937e">
<ul class="org-ul">
<li><a href="https://www.desy.de/user/projects/LitProg/fweb-faq/top.html">FAQ</a> for FWEB (slightly old)</li>
<li><a href="https://w3.pppl.gov/~krommes/fweb.html">Manual</a> for FWEB</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-07-30 Fri 08:36.</p>
</div>
</body>
</html>